{"name":"UnCubanoDev","headerTaglineOne":"Hello 👋","headerTaglineTwo":"I'm Raul - a passionate","headerTaglineThree":"mobile developer","headerTaglineFour":" based in Pinar del Río, Cuba.","showBlog":false,"darkMode":true,"socials":[{"id":"1","title":"Github","link":"https://github.com/uncubanodev"},{"id":"2","title":"Twitter","link":"https://twitter.com/raul_uci"},{"id":"3","title":"Email","link":"mailto:uncubanodev@gmail.com"}],"projects":[{"id":"1","title":"BAC Animal Welfare App","description":"Mobile Development","imageSrc":"https://diariodecuba.com/sites/default/files/images/2022-02/bienestar-animal-cuba.jpg","url":""},{"id":"2","title":"Industrial Sensor Integration","description":"Mobile Development","imageSrc":"https://is1-ssl.mzstatic.com/image/thumb/Purple221/v4/92/2b/b4/922bb420-1970-2491-a7cd-47051f8750c6/pr_source.png/750x750bb.jpeg","url":"https://apps.apple.com/us/app/fido-universal/id1255580054"},{"id":"3","title":"E-commerce Apps","description":"Mobile Development","imageSrc":"https://iep.edu.es/wp-content/uploads/2018/08/que-es-ecommerce-1200x900.webp","url":""}],"services":[{"id":"1","title":"Mobile Development","description":"Building scalable and robust applications using modern technologies such as Flutter, Kotlin, and Java."},{"id":"2","title":"Clean Architecture","description":"Specialized in clean architecture, reusable components, and performance-oriented UI/UX design."},{"id":"3","title":"Full-Stack Solutions","description":"Proven leadership in frontend projects and full-stack solutions focused on maintainability and automated testing."},{"id":"4","title":"Agile Methodologies","description":"Experienced in Scrum and Kanban, delivering high-impact features in agile cycles."}],"aboutpara":"Mobile software developer with over 4 years of experience building scalable and robust applications using modern technologies such as Flutter, Kotlin, and Java. Specialized in clean architecture, reusable components, and performance-oriented UI/UX design. Proven leadership in frontend projects and full-stack solutions focused on maintainability, automated testing, and agile methodologies. Passionate about solving real-world problems through technology, contributing to cross-functional teams, and delivering high-impact products.","resume":{"tagline":"👋  I'm a mobile software developer with expertise in Flutter, Kotlin, and Java.","description":"I have delivered high-impact mobile applications across e-commerce, healthcare, and education sectors. Well-versed in clean architecture, automated testing, and agile methodologies.","experiences":[{"id":"1","dates":"Feb 2024 – Oct 2024","type":"Full Time","position":"Senior Flutter Developer at DClick Soluciones","bullets":["Led migration from legacy Xamarin systems to Flutter, improving development speed and maintainability.","Integrated pressure and cathode sensors into industrial applications with real-time data accuracy.","Provided production support, resolving critical issues and ensuring system stability.","Advocated for best practices in clean architecture, modularity, and automated testing."]},{"id":"2","dates":"Oct 2018 – Dec 2022","type":"Full Time","position":"Mobile Developer (Flutter & Native Android) at GoDjango","bullets":["Delivered over 10 custom mobile apps in Java/Kotlin and Flutter across e-commerce, healthcare, and education.","Designed scalable modular architectures to ensure long-term maintainability.","Collaborated with backend and design teams to deliver user-focused, functional applications.","Participated in agile cycles (Scrum/Kanban), leading delivery of high-impact features."]},{"id":"3","dates":"Jul 2020 – Mar 2022","type":"Full Time","position":"Lead Mobile & Backend Engineer at Bienestar Animal en Cuba (BAC)","bullets":["Developed and led the national animal welfare app in Cuba with over 40,000 active users.","Implemented offline mode, accessibility features, and an admin panel for institutional use.","Built both frontend (Flutter) and backend (Django), integrating complex business logic and security protocols.","Led QA strategy and unit testing, reducing bugs in production by over 30%."]}],"education":{"universityName":"University of Informatic Sciences (UCI)","universityDate":"Sep 2019 – Feb 2022","universityPara":"Studies in Computer Science. Training in algorithms, data structures, relational databases, software design, and cybersecurity. Strong performance in ACM-ICPC programming competitions. Applied Flutter and backend skills in practical projects. Collaborated on institutional software solutions for the public sector"},"languages":["Dart","Kotlin","Java","Python","C#","PHP"],"frameworks":["Flutter","Django","Laravel"],"others":["Docker","Git","CI/CD","REST API","GraphQL","Scrum","Kanban"]},"showResume":true,"showCursor":false}